<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

use DB;

class GeograpySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $stages = [
            ['name' => "Курская область", 'type' => "Металоконструкции", 'geo' =>"51.68004575628376,36.30003149999989" ],
            ['name' => "Ленинградская область", 'type' => "Металоконструкции", 'geo' =>"59.9495683727952,30.32136172656246" ],
            ['name' => "Калининградская область", 'type' => "Металоконструкции", 'geo' =>"54.70881686529494,20.51278440234369" ],
            ['name' => "Воронежская область", 'type' => "Металоконструкции", 'geo' =>"51.66427984765799,39.2054150735063" ],
            ['name' => "Московская область", 'type' => "Металоконструкции", 'geo' =>"55.76073437834862,37.62193385937497" ],
            ['name' => "Орел", 'type' => "Металоконструкции", 'geo' =>"52.971796131697246,36.06267935279479" ],
            ['name' => "Тула", 'type' => "Металоконструкции", 'geo' =>"54.19385839353612,37.61713529364005" ],
            ['name' => "Брянск", 'type' => "Металоконструкции", 'geo' =>"53.242667103375084,34.36305725241195" ],
            ['name' => "Белгород", 'type' => "Металоконструкции", 'geo' =>"50.59666586676158,36.587731380743996" ],
            ['name' => "Краснодар", 'type' => "Металоконструкции", 'geo' =>"45.04605535248811,38.97818459856407" ],
            ['name' => "Калуга", 'type' => "Металоконструкции", 'geo' =>"54.50595772466993,36.25202170418495" ],
            ['name' => "Липецк", 'type' => "Металоконструкции", 'geo' =>"52.609355607298994,39.59853728993959" ],
            ['name' => "Лиски", 'type' => "Металоконструкции", 'geo' =>"50.987466048965544,39.495792993282535" ],
            ['name' => "Ст. Оскол", 'type' => "Металоконструкции", 'geo' =>"51.29780354630295,37.83248668768324" ],
            ['name' => "Ливны", 'type' => "Металоконструкции", 'geo' =>"52.42547096418742,37.60856890756229" ],

            ['name' => "Курская АЭС", 'type' => "АЭС", 'geo' => "51.814167,35.392222"],
            ['name' => "Новоронеж АЭС", 'type' => "АЭС", 'geo' => "51.306389,39.205833"],
            ['name' => "Бангладеш АЭС", 'type' => "АЭС", 'geo' => "23.627222,89.721111"], // Руппур
            ['name' => "Эль-дабаа АЭС", 'type' => "АЭС", 'geo' => "31.117222,28.429444"],

            ['name' => "Якутск", 'type' => "Теплицы", 'geo' => "62.027222,129.732222"],
            ['name' => "Минск", 'type' => "Теплицы", 'geo' => "53.902496,27.561481"],
            ['name' => "Курск", 'type' => "Теплицы", 'geo' => "51.730361,36.192647"],
            ['name' => "Москва", 'type' => "Теплицы", 'geo' => "55.755825,37.617298"],
            ['name' => "Калуга", 'type' => "Теплицы", 'geo' => "54.513845,36.261215"],
            ['name' => "Дмитров, МО", 'type' => "Теплицы", 'geo' => "56.347057,37.521667"],
            ['name' => "Пятигорск", 'type' => "Теплицы", 'geo' => "44.04861,43.05944"],
            ['name' => "Ивня, Белгородская обл", 'type' => "Теплицы", 'geo' => "51.067222,36.158333"],
        ];

        DB::table('geograpies')->insert($stages);
    }
}
