<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

use DB;

class GeograpySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $stages = [
            ['name' => "Курская область", 'geo' =>"51.68004575628376,36.30003149999989" ],
            ['name' => "Ленинградская область", 'geo' =>"59.9495683727952,30.32136172656246" ],
            ['name' => "Калининградская область", 'geo' =>"54.70881686529494,20.51278440234369" ],
            ['name' => "Воронежская область", 'geo' =>"51.66427984765799,39.2054150735063" ],
            ['name' => "Московская область", 'geo' =>"55.76073437834862,37.62193385937497" ],
            ['name' => "Орел", 'geo' =>"52.971796131697246,36.06267935279479" ],
            ['name' => "Тула", 'geo' =>"54.19385839353612,37.61713529364005" ],
            ['name' => "Брянск", 'geo' =>"53.242667103375084,34.36305725241195" ],
            ['name' => "Белгород", 'geo' =>"50.59666586676158,36.587731380743996" ],
            ['name' => "Краснодар", 'geo' =>"45.04605535248811,38.97818459856407" ],
            ['name' => "Калуга", 'geo' =>"54.50595772466993,36.25202170418495" ],
            ['name' => "Липецк", 'geo' =>"52.609355607298994,39.59853728993959" ],
            ['name' => "Лиски", 'geo' =>"50.987466048965544,39.495792993282535" ],
            ['name' => "Ст. Оскол", 'geo' =>"51.29780354630295,37.83248668768324" ],
            ['name' => "Ливны", 'geo' =>"52.42547096418742,37.60856890756229" ],

        ];

        DB::table('geograpies')->insert($stages);
    }
}
